#!/bin/bash
echo "1. Используйте команды операционной системы Linux и создайте две новых директории – «Игрушки для школьников» и «Игрушки для дошколят»" && sleep 3
mkdir "Игрушки для школьников" "Игрушки для дошколят"
ls Игрушки*

echo "2. Создайте в директории «Игрушки для школьников» текстовые файлы - «Роботы», «Конструктор», «Настольные игры»" && sleep 3
touch "Игрушки для школьников"/Роботы "Игрушки для школьников"/Конструкторы "Игрушки для школьников"/"Настольные игры"
tree "Игрушки для школьников"

echo "3. Создайте в директории «Игрушки для дошколят» текстовые файлы «Мягкие игрушки», «Куклы», «Машинки»" && sleep 3
touch "Игрушки для дошколят"/"Мягкие игрушки" "Игрушки для дошколят"/Куклы "Игрушки для дошколят"/Машинки 
tree "Игрушки для дошколят"

echo "4. Объединить 2 директории в одну «Имя Игрушки»" && sleep 3
mv "Игрушки для школьников"/* "Игрушки для дошколят" && rmdir "Игрушки для школьников" && mv "Игрушки для дошколят" "Имя Игрушки"
tree "Имя игрушки"

echo "5. Переименовать директорию «Имя Игрушки» в «Игрушки»" && sleep 3
mv "Имя Игрушки" Игрушки
tree "Игрушки"
 
echo "6. Просмотреть содержимое каталога «Игрушки»" && sleep 3
ls -al Игрушки
echo "7. Установить и удалить snap-пакет. (Любой, какой хотите)" && sleep 3
sudo snap install powershell --classic
pwsh -c dir
sudo snap remove powershell

echo "8. Добавить произвольную задачу для выполнения каждые 3 минуты (Например, запись в текстовый файл чего-то или копирование из каталога А в каталог Б)." && sleep 3
echo "*/3 * * * * date >> ~/date" >> ~/tmp
crontab ~/tmp
rm ~/tmp
crontab -l

